t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/inc/hw_mcanss.h
#define MCAN_IE_TEFFE_SHIFT                                (14U)
#define MCAN_IE_TEFFE_MASK                                 (0x00004000U)

#define MCAN_IE_TEFLE_SHIFT                                (15U)
#define MCAN_IE_TEFLE_MASK                                 (0x00008000U)

#define MCAN_IE_TSWE_SHIFT                                 (16U)
#define MCAN_IE_TSWE_MASK                                  (0x00010000U)

#define MCAN_IE_MRAFE_SHIFT                                (17U)
#define MCAN_IE_MRAFE_MASK                                 (0x00020000U)

#define MCAN_IE_TOOE_SHIFT                                 (18U)
#define MCAN_IE_TOOE_MASK                                  (0x00040000U)

#define MCAN_IE_DRX_SHIFT                                  (19U)
#define MCAN_IE_DRX_MASK                                   (0x00080000U)

#define MCAN_IE_BECE_SHIFT                                 (20U)
#define MCAN_IE_BECE_MASK                                  (0x00100000U)

#define MCAN_IE_BEUE_SHIFT                                 (21U)
#define MCAN_IE_BEUE_MASK                                  (0x00200000U)

#define MCAN_IE_ELOE_SHIFT                                 (22U)
#define MCAN_IE_ELOE_MASK                                  (0x00400000U)

#define MCAN_IE_EPE_SHIFT                                  (23U)
#define MCAN_IE_EPE_MASK                                   (0x00800000U)

#define MCAN_IE_EWE_SHIFT                                  (24U)
#define MCAN_IE_EWE_MASK                                   (0x01000000U)

#define MCAN_IE_BOE_SHIFT                                  (25U)
#define MCAN_IE_BOE_MASK                                   (0x02000000U)

#define MCAN_IE_WDIE_SHIFT                                 (26U)
#define MCAN_IE_WDIE_MASK                                  (0x04000000U)

#define MCAN_IE_PEAE_SHIFT                                 (27U)
#define MCAN_IE_PEAE_MASK                                  (0x08000000U)

#define MCAN_IE_PEDE_SHIFT                                 (28U)
#define MCAN_IE_PEDE_MASK                                  (0x10000000U)

#define MCAN_IE_ARAE_SHIFT                                 (29U)
#define MCAN_IE_ARAE_MASK                                  (0x20000000U)

#define MCAN_ILS_RF0NL_SHIFT                               (0U)
#define MCAN_ILS_RF0NL_MASK                                (0x00000001U)

#define MCAN_ILS_RF0WL_SHIFT                               (1U)
#define MCAN_ILS_RF0WL_MASK                                (0x00000002U)

#define MCAN_ILS_RF0FL_SHIFT                               (2U)
#define MCAN_ILS_RF0FL_MASK                                (0x00000004U)

#define MCAN_ILS_RF0LL_SHIFT                               (3U)
#define MCAN_ILS_RF0LL_MASK                                (0x00000008U)

#define MCAN_ILS_RF1NL_SHIFT                               (4U)
#define MCAN_ILS_RF1NL_MASK                                (0x00000010U)

#define MCAN_ILS_RF1WL_SHIFT                               (5U)
#define MCAN_ILS_RF1WL_MASK                                (0x00000020U)

#define MCAN_ILS_RF1FL_SHIFT                               (6U)
#define MCAN_ILS_RF1FL_MASK                                (0x00000040U)

#define MCAN_ILS_RF1LL_SHIFT                               (7U)
#define MCAN_ILS_RF1LL_MASK                                (0x00000080U)

#define MCAN_ILS_HPML_SHIFT                                (8U)
#define MCAN_ILS_HPML_MASK                                 (0x00000100U)

#define MCAN_ILS_TCL_SHIFT                                 (9U)
#define MCAN_ILS_TCL_MASK                                  (0x00000200U)

#define MCAN_ILS_TCFL_SHIFT                                (10U)
#define MCAN_ILS_TCFL_MASK                                 (0x00000400U)

#define MCAN_ILS_TFEL_SHIFT                                (11U)
#define MCAN_ILS_TFEL_MASK                                 (0x00000800U)

#define MCAN_ILS_TEFNL_SHIFT                               (12U)
#define MCAN_ILS_TEFNL_MASK                                (0x00001000U)

#define MCAN_ILS_TEFWL_SHIFT                               (13U)
#define MCAN_ILS_TEFWL_MASK                                (0x00002000U)

#define MCAN_ILS_TEFFL_SHIFT                               (14U)
#define MCAN_ILS_TEFFL_MASK                                (0x00004000U)

#define MCAN_ILS_TEFLL_SHIFT                               (15U)
#define MCAN_ILS_TEFLL_MASK                                (0x00008000U)

#define MCAN_ILS_TSWL_SHIFT                                (16U)
#define MCAN_ILS_TSWL_MASK                                 (0x00010000U)

#define MCAN_ILS_MRAFL_SHIFT                               (17U)
#define MCAN_ILS_MRAFL_MASK                                (0x00020000U)

#define MCAN_ILS_TOOL_SHIFT                                (18U)
#define MCAN_ILS_TOOL_MASK                                 (0x00040000U)

#define MCAN_ILS_DRXL_SHIFT                                (19U)
#define MCAN_ILS_DRXL_MASK                                 (0x00080000U)

#define MCAN_ILS_BECL_SHIFT                                (20U)
#define MCAN_ILS_BECL_MASK                                 (0x00100000U)

#define MCAN_ILS_BEUL_SHIFT                                (21U)
#define MCAN_ILS_BEUL_MASK                                 (0x00200000U)

#define MCAN_ILS_ELOL_SHIFT                                (22U)
#define MCAN_ILS_ELOL_MASK                                 (0x00400000U)

#define MCAN_ILS_EPL_SHIFT                                 (23U)
#define MCAN_ILS_EPL_MASK                                  (0x00800000U)

#define MCAN_ILS_EWL_SHIFT                                 (24U)
#define MCAN_ILS_EWL_MASK                                  (0x01000000U)

#define MCAN_ILS_BOL_SHIFT                                 (25U)
#define MCAN_ILS_BOL_MASK                                  (0x02000000U)

#define MCAN_ILS_WDIL_SHIFT                                (26U)
#define MCAN_ILS_WDIL_MASK                                 (0x04000000U)

#define MCAN_ILS_PEAL_SHIFT                                (27U)
#define MCAN_ILS_PEAL_MASK                                 (0x08000000U)

#define MCAN_ILS_PEDL_SHIFT                                (28U)
#define MCAN_ILS_PEDL_MASK                                 (0x10000000U)

#define MCAN_ILS_ARAL_SHIFT                                (29U)
#define MCAN_ILS_ARAL_MASK                                 (0x20000000U)

#define MCAN_ILE_EINT0_SHIFT                               (0U)
#define MCAN_ILE_EINT0_MASK                                (0x00000001U)

