t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/inc/hw_mcanss.h
#define MCAN_NDAT1_ND31_SHIFT                              (31U)
#define MCAN_NDAT1_ND31_MASK                               (0x80000000U)

#define MCAN_NDAT2_ND32_SHIFT                              (0U)
#define MCAN_NDAT2_ND32_MASK                               (0x00000001U)

#define MCAN_NDAT2_ND33_SHIFT                              (1U)
#define MCAN_NDAT2_ND33_MASK                               (0x00000002U)

#define MCAN_NDAT2_ND34_SHIFT                              (2U)
#define MCAN_NDAT2_ND34_MASK                               (0x00000004U)

#define MCAN_NDAT2_ND35_SHIFT                              (3U)
#define MCAN_NDAT2_ND35_MASK                               (0x00000008U)

#define MCAN_NDAT2_ND36_SHIFT                              (4U)
#define MCAN_NDAT2_ND36_MASK                               (0x00000010U)

#define MCAN_NDAT2_ND37_SHIFT                              (5U)
#define MCAN_NDAT2_ND37_MASK                               (0x00000020U)

#define MCAN_NDAT2_ND38_SHIFT                              (6U)
#define MCAN_NDAT2_ND38_MASK                               (0x00000040U)

#define MCAN_NDAT2_ND39_SHIFT                              (7U)
#define MCAN_NDAT2_ND39_MASK                               (0x00000080U)

#define MCAN_NDAT2_ND40_SHIFT                              (8U)
#define MCAN_NDAT2_ND40_MASK                               (0x00000100U)

#define MCAN_NDAT2_ND41_SHIFT                              (9U)
#define MCAN_NDAT2_ND41_MASK                               (0x00000200U)

#define MCAN_NDAT2_ND42_SHIFT                              (10U)
#define MCAN_NDAT2_ND42_MASK                               (0x00000400U)

#define MCAN_NDAT2_ND43_SHIFT                              (11U)
#define MCAN_NDAT2_ND43_MASK                               (0x00000800U)

#define MCAN_NDAT2_ND44_SHIFT                              (12U)
#define MCAN_NDAT2_ND44_MASK                               (0x00001000U)

#define MCAN_NDAT2_ND45_SHIFT                              (13U)
#define MCAN_NDAT2_ND45_MASK                               (0x00002000U)

#define MCAN_NDAT2_ND46_SHIFT                              (14U)
#define MCAN_NDAT2_ND46_MASK                               (0x00004000U)

#define MCAN_NDAT2_ND47_SHIFT                              (15U)
#define MCAN_NDAT2_ND47_MASK                               (0x00008000U)

#define MCAN_NDAT2_ND48_SHIFT                              (16U)
#define MCAN_NDAT2_ND48_MASK                               (0x00010000U)

#define MCAN_NDAT2_ND49_SHIFT                              (17U)
#define MCAN_NDAT2_ND49_MASK                               (0x00020000U)

#define MCAN_NDAT2_ND50_SHIFT                              (18U)
#define MCAN_NDAT2_ND50_MASK                               (0x00040000U)

#define MCAN_NDAT2_ND51_SHIFT                              (19U)
#define MCAN_NDAT2_ND51_MASK                               (0x00080000U)

#define MCAN_NDAT2_ND52_SHIFT                              (20U)
#define MCAN_NDAT2_ND52_MASK                               (0x00100000U)

#define MCAN_NDAT2_ND53_SHIFT                              (21U)
#define MCAN_NDAT2_ND53_MASK                               (0x00200000U)

#define MCAN_NDAT2_ND54_SHIFT                              (22U)
#define MCAN_NDAT2_ND54_MASK                               (0x00400000U)

#define MCAN_NDAT2_ND55_SHIFT                              (23U)
#define MCAN_NDAT2_ND55_MASK                               (0x00800000U)

#define MCAN_NDAT2_ND56_SHIFT                              (24U)
#define MCAN_NDAT2_ND56_MASK                               (0x01000000U)

#define MCAN_NDAT2_ND57_SHIFT                              (25U)
#define MCAN_NDAT2_ND57_MASK                               (0x02000000U)

#define MCAN_NDAT2_ND58_SHIFT                              (26U)
#define MCAN_NDAT2_ND58_MASK                               (0x04000000U)

#define MCAN_NDAT2_ND59_SHIFT                              (27U)
#define MCAN_NDAT2_ND59_MASK                               (0x08000000U)

#define MCAN_NDAT2_ND60_SHIFT                              (28U)
#define MCAN_NDAT2_ND60_MASK                               (0x10000000U)

#define MCAN_NDAT2_ND61_SHIFT                              (29U)
#define MCAN_NDAT2_ND61_MASK                               (0x20000000U)

#define MCAN_NDAT2_ND62_SHIFT                              (30U)
#define MCAN_NDAT2_ND62_MASK                               (0x40000000U)

#define MCAN_NDAT2_ND63_SHIFT                              (31U)
#define MCAN_NDAT2_ND63_MASK                               (0x80000000U)

#define MCAN_RXF0C_F0SA_SHIFT                              (2U)
#define MCAN_RXF0C_F0SA_MASK                               (0x0000fffcU)

#define MCAN_RXF0C_F0S_SHIFT                               (16U)
#define MCAN_RXF0C_F0S_MASK                                (0x007f0000U)

#define MCAN_RXF0C_F0WM_SHIFT                              (24U)
#define MCAN_RXF0C_F0WM_MASK                               (0x7f000000U)

#define MCAN_RXF0C_F0OM_SHIFT                              (31U)
#define MCAN_RXF0C_F0OM_MASK                               (0x80000000U)

#define MCAN_RXF0S_F0FL_SHIFT                              (0U)
#define MCAN_RXF0S_F0FL_MASK                               (0x0000007fU)

#define MCAN_RXF0S_F0GI_SHIFT                              (8U)
#define MCAN_RXF0S_F0GI_MASK                               (0x00003f00U)

#define MCAN_RXF0S_F0PI_SHIFT                              (16U)
#define MCAN_RXF0S_F0PI_MASK                               (0x003f0000U)

#define MCAN_RXF0S_F0F_SHIFT                               (24U)
#define MCAN_RXF0S_F0F_MASK                                (0x01000000U)

#define MCAN_RXF0S_RF0L_SHIFT                              (25U)
#define MCAN_RXF0S_RF0L_MASK                               (0x02000000U)

#define MCAN_RXF0A_F0AI_SHIFT                              (0U)
#define MCAN_RXF0A_F0AI_MASK                               (0x0000003fU)

#define MCAN_RXBC_RBSA_SHIFT                               (2U)
#define MCAN_RXBC_RBSA_MASK                                (0x0000fffcU)

#define MCAN_RXF1C_F1SA_SHIFT                              (2U)
#define MCAN_RXF1C_F1SA_MASK                               (0x0000fffcU)

#define MCAN_RXF1C_F1S_SHIFT                               (16U)
#define MCAN_RXF1C_F1S_MASK                                (0x007f0000U)

#define MCAN_RXF1C_F1WM_SHIFT                              (24U)
#define MCAN_RXF1C_F1WM_MASK                               (0x7f000000U)

