t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/inc/hw_mcanss.h
#define MCAN_TXBRP_TRP24_SHIFT                             (24U)
#define MCAN_TXBRP_TRP24_MASK                              (0x01000000U)

#define MCAN_TXBRP_TRP25_SHIFT                             (25U)
#define MCAN_TXBRP_TRP25_MASK                              (0x02000000U)

#define MCAN_TXBRP_TRP26_SHIFT                             (26U)
#define MCAN_TXBRP_TRP26_MASK                              (0x04000000U)

#define MCAN_TXBRP_TRP27_SHIFT                             (27U)
#define MCAN_TXBRP_TRP27_MASK                              (0x08000000U)

#define MCAN_TXBRP_TRP28_SHIFT                             (28U)
#define MCAN_TXBRP_TRP28_MASK                              (0x10000000U)

#define MCAN_TXBRP_TRP29_SHIFT                             (29U)
#define MCAN_TXBRP_TRP29_MASK                              (0x20000000U)

#define MCAN_TXBRP_TRP30_SHIFT                             (30U)
#define MCAN_TXBRP_TRP30_MASK                              (0x40000000U)

#define MCAN_TXBRP_TRP31_SHIFT                             (31U)
#define MCAN_TXBRP_TRP31_MASK                              (0x80000000U)

#define MCAN_TXBAR_AR0_SHIFT                               (0U)
#define MCAN_TXBAR_AR0_MASK                                (0x00000001U)

#define MCAN_TXBAR_AR1_SHIFT                               (1U)
#define MCAN_TXBAR_AR1_MASK                                (0x00000002U)

#define MCAN_TXBAR_AR2_SHIFT                               (2U)
#define MCAN_TXBAR_AR2_MASK                                (0x00000004U)

#define MCAN_TXBAR_AR3_SHIFT                               (3U)
#define MCAN_TXBAR_AR3_MASK                                (0x00000008U)

#define MCAN_TXBAR_AR4_SHIFT                               (4U)
#define MCAN_TXBAR_AR4_MASK                                (0x00000010U)

#define MCAN_TXBAR_AR5_SHIFT                               (5U)
#define MCAN_TXBAR_AR5_MASK                                (0x00000020U)

#define MCAN_TXBAR_AR6_SHIFT                               (6U)
#define MCAN_TXBAR_AR6_MASK                                (0x00000040U)

#define MCAN_TXBAR_AR7_SHIFT                               (7U)
#define MCAN_TXBAR_AR7_MASK                                (0x00000080U)

#define MCAN_TXBAR_AR8_SHIFT                               (8U)
#define MCAN_TXBAR_AR8_MASK                                (0x00000100U)

#define MCAN_TXBAR_AR9_SHIFT                               (9U)
#define MCAN_TXBAR_AR9_MASK                                (0x00000200U)

#define MCAN_TXBAR_AR10_SHIFT                              (10U)
#define MCAN_TXBAR_AR10_MASK                               (0x00000400U)

#define MCAN_TXBAR_AR11_SHIFT                              (11U)
#define MCAN_TXBAR_AR11_MASK                               (0x00000800U)

#define MCAN_TXBAR_AR12_SHIFT                              (12U)
#define MCAN_TXBAR_AR12_MASK                               (0x00001000U)

#define MCAN_TXBAR_AR13_SHIFT                              (13U)
#define MCAN_TXBAR_AR13_MASK                               (0x00002000U)

#define MCAN_TXBAR_AR14_SHIFT                              (14U)
#define MCAN_TXBAR_AR14_MASK                               (0x00004000U)

#define MCAN_TXBAR_AR15_SHIFT                              (15U)
#define MCAN_TXBAR_AR15_MASK                               (0x00008000U)

#define MCAN_TXBAR_AR16_SHIFT                              (16U)
#define MCAN_TXBAR_AR16_MASK                               (0x00010000U)

#define MCAN_TXBAR_AR17_SHIFT                              (17U)
#define MCAN_TXBAR_AR17_MASK                               (0x00020000U)

#define MCAN_TXBAR_AR18_SHIFT                              (18U)
#define MCAN_TXBAR_AR18_MASK                               (0x00040000U)

#define MCAN_TXBAR_AR19_SHIFT                              (19U)
#define MCAN_TXBAR_AR19_MASK                               (0x00080000U)

#define MCAN_TXBAR_AR20_SHIFT                              (20U)
#define MCAN_TXBAR_AR20_MASK                               (0x00100000U)

#define MCAN_TXBAR_AR21_SHIFT                              (21U)
#define MCAN_TXBAR_AR21_MASK                               (0x00200000U)

#define MCAN_TXBAR_AR22_SHIFT                              (22U)
#define MCAN_TXBAR_AR22_MASK                               (0x00400000U)

#define MCAN_TXBAR_AR23_SHIFT                              (23U)
#define MCAN_TXBAR_AR23_MASK                               (0x00800000U)

#define MCAN_TXBAR_AR24_SHIFT                              (24U)
#define MCAN_TXBAR_AR24_MASK                               (0x01000000U)

#define MCAN_TXBAR_AR25_SHIFT                              (25U)
#define MCAN_TXBAR_AR25_MASK                               (0x02000000U)

#define MCAN_TXBAR_AR26_SHIFT                              (26U)
#define MCAN_TXBAR_AR26_MASK                               (0x04000000U)

#define MCAN_TXBAR_AR27_SHIFT                              (27U)
#define MCAN_TXBAR_AR27_MASK                               (0x08000000U)

#define MCAN_TXBAR_AR28_SHIFT                              (28U)
#define MCAN_TXBAR_AR28_MASK                               (0x10000000U)

#define MCAN_TXBAR_AR29_SHIFT                              (29U)
#define MCAN_TXBAR_AR29_MASK                               (0x20000000U)

#define MCAN_TXBAR_AR30_SHIFT                              (30U)
#define MCAN_TXBAR_AR30_MASK                               (0x40000000U)

#define MCAN_TXBAR_AR31_SHIFT                              (31U)
#define MCAN_TXBAR_AR31_MASK                               (0x80000000U)

#define MCAN_TXBCR_CR0_SHIFT                               (0U)
#define MCAN_TXBCR_CR0_MASK                                (0x00000001U)

#define MCAN_TXBCR_CR1_SHIFT                               (1U)
#define MCAN_TXBCR_CR1_MASK                                (0x00000002U)

#define MCAN_TXBCR_CR2_SHIFT                               (2U)
#define MCAN_TXBCR_CR2_MASK                                (0x00000004U)

#define MCAN_TXBCR_CR3_SHIFT                               (3U)
#define MCAN_TXBCR_CR3_MASK                                (0x00000008U)

#define MCAN_TXBCR_CR4_SHIFT                               (4U)
#define MCAN_TXBCR_CR4_MASK                                (0x00000010U)

#define MCAN_TXBCR_CR5_SHIFT                               (5U)
#define MCAN_TXBCR_CR5_MASK                                (0x00000020U)

