t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/inc/hw_mcanss.h
#define MCAN_TXBTO_TO22_SHIFT                              (22U)
#define MCAN_TXBTO_TO22_MASK                               (0x00400000U)

#define MCAN_TXBTO_TO23_SHIFT                              (23U)
#define MCAN_TXBTO_TO23_MASK                               (0x00800000U)

#define MCAN_TXBTO_TO24_SHIFT                              (24U)
#define MCAN_TXBTO_TO24_MASK                               (0x01000000U)

#define MCAN_TXBTO_TO25_SHIFT                              (25U)
#define MCAN_TXBTO_TO25_MASK                               (0x02000000U)

#define MCAN_TXBTO_TO26_SHIFT                              (26U)
#define MCAN_TXBTO_TO26_MASK                               (0x04000000U)

#define MCAN_TXBTO_TO27_SHIFT                              (27U)
#define MCAN_TXBTO_TO27_MASK                               (0x08000000U)

#define MCAN_TXBTO_TO28_SHIFT                              (28U)
#define MCAN_TXBTO_TO28_MASK                               (0x10000000U)

#define MCAN_TXBTO_TO29_SHIFT                              (29U)
#define MCAN_TXBTO_TO29_MASK                               (0x20000000U)

#define MCAN_TXBTO_TO30_SHIFT                              (30U)
#define MCAN_TXBTO_TO30_MASK                               (0x40000000U)

#define MCAN_TXBTO_TO31_SHIFT                              (31U)
#define MCAN_TXBTO_TO31_MASK                               (0x80000000U)

#define MCAN_TXBCF_CF0_SHIFT                               (0U)
#define MCAN_TXBCF_CF0_MASK                                (0x00000001U)

#define MCAN_TXBCF_CF1_SHIFT                               (1U)
#define MCAN_TXBCF_CF1_MASK                                (0x00000002U)

#define MCAN_TXBCF_CF2_SHIFT                               (2U)
#define MCAN_TXBCF_CF2_MASK                                (0x00000004U)

#define MCAN_TXBCF_CF3_SHIFT                               (3U)
#define MCAN_TXBCF_CF3_MASK                                (0x00000008U)

#define MCAN_TXBCF_CF4_SHIFT                               (4U)
#define MCAN_TXBCF_CF4_MASK                                (0x00000010U)

#define MCAN_TXBCF_CF5_SHIFT                               (5U)
#define MCAN_TXBCF_CF5_MASK                                (0x00000020U)

#define MCAN_TXBCF_CF6_SHIFT                               (6U)
#define MCAN_TXBCF_CF6_MASK                                (0x00000040U)

#define MCAN_TXBCF_CF7_SHIFT                               (7U)
#define MCAN_TXBCF_CF7_MASK                                (0x00000080U)

#define MCAN_TXBCF_CF8_SHIFT                               (8U)
#define MCAN_TXBCF_CF8_MASK                                (0x00000100U)

#define MCAN_TXBCF_CF9_SHIFT                               (9U)
#define MCAN_TXBCF_CF9_MASK                                (0x00000200U)

#define MCAN_TXBCF_CF10_SHIFT                              (10U)
#define MCAN_TXBCF_CF10_MASK                               (0x00000400U)

#define MCAN_TXBCF_CF11_SHIFT                              (11U)
#define MCAN_TXBCF_CF11_MASK                               (0x00000800U)

#define MCAN_TXBCF_CF12_SHIFT                              (12U)
#define MCAN_TXBCF_CF12_MASK                               (0x00001000U)

#define MCAN_TXBCF_CF13_SHIFT                              (13U)
#define MCAN_TXBCF_CF13_MASK                               (0x00002000U)

#define MCAN_TXBCF_CF14_SHIFT                              (14U)
#define MCAN_TXBCF_CF14_MASK                               (0x00004000U)

#define MCAN_TXBCF_CF15_SHIFT                              (15U)
#define MCAN_TXBCF_CF15_MASK                               (0x00008000U)

#define MCAN_TXBCF_CF16_SHIFT                              (16U)
#define MCAN_TXBCF_CF16_MASK                               (0x00010000U)

#define MCAN_TXBCF_CF17_SHIFT                              (17U)
#define MCAN_TXBCF_CF17_MASK                               (0x00020000U)

#define MCAN_TXBCF_CF18_SHIFT                              (18U)
#define MCAN_TXBCF_CF18_MASK                               (0x00040000U)

#define MCAN_TXBCF_CF19_SHIFT                              (19U)
#define MCAN_TXBCF_CF19_MASK                               (0x00080000U)

#define MCAN_TXBCF_CF20_SHIFT                              (20U)
#define MCAN_TXBCF_CF20_MASK                               (0x00100000U)

#define MCAN_TXBCF_CF21_SHIFT                              (21U)
#define MCAN_TXBCF_CF21_MASK                               (0x00200000U)

#define MCAN_TXBCF_CF22_SHIFT                              (22U)
#define MCAN_TXBCF_CF22_MASK                               (0x00400000U)

#define MCAN_TXBCF_CF23_SHIFT                              (23U)
#define MCAN_TXBCF_CF23_MASK                               (0x00800000U)

#define MCAN_TXBCF_CF24_SHIFT                              (24U)
#define MCAN_TXBCF_CF24_MASK                               (0x01000000U)

#define MCAN_TXBCF_CF25_SHIFT                              (25U)
#define MCAN_TXBCF_CF25_MASK                               (0x02000000U)

#define MCAN_TXBCF_CF26_SHIFT                              (26U)
#define MCAN_TXBCF_CF26_MASK                               (0x04000000U)

#define MCAN_TXBCF_CF27_SHIFT                              (27U)
#define MCAN_TXBCF_CF27_MASK                               (0x08000000U)

#define MCAN_TXBCF_CF28_SHIFT                              (28U)
#define MCAN_TXBCF_CF28_MASK                               (0x10000000U)

#define MCAN_TXBCF_CF29_SHIFT                              (29U)
#define MCAN_TXBCF_CF29_MASK                               (0x20000000U)

#define MCAN_TXBCF_CF30_SHIFT                              (30U)
#define MCAN_TXBCF_CF30_MASK                               (0x40000000U)

#define MCAN_TXBCF_CF31_SHIFT                              (31U)
#define MCAN_TXBCF_CF31_MASK                               (0x80000000U)

#define MCAN_TXBTIE_TIE0_SHIFT                             (0U)
#define MCAN_TXBTIE_TIE0_MASK                              (0x00000001U)

#define MCAN_TXBTIE_TIE1_SHIFT                             (1U)
#define MCAN_TXBTIE_TIE1_MASK                              (0x00000002U)

#define MCAN_TXBTIE_TIE2_SHIFT                             (2U)
#define MCAN_TXBTIE_TIE2_MASK                              (0x00000004U)

#define MCAN_TXBTIE_TIE3_SHIFT                             (3U)
#define MCAN_TXBTIE_TIE3_MASK                              (0x00000008U)

